{
    "profile": {
        "name": "Andy Kumeda",
        "title": "Senior Network Engineer | Network Architect",
        "ccie": "CCIE #3406",
        "email": "andy@kumeda.com",
        "phone": "(310) 493-1793",
        "website": "andykumeda.com",
        "linkedin": "https://www.linkedin.com/in/andykumeda/",
        "github": "https://github.com/andykumeda"
    },
    "summary": "Senior Network Engineer with 30+ years designing and operating large-scale enterprise networks in healthcare and high-availability environments. Currently leading network modernization at Ventura County Health Care Agency, migrating legacy infrastructure to Catalyst 9000 platforms while maintaining zero disruption to clinical operations. Deep expertise in Software-Defined Access, Identity Services Engine, routing protocols, MPLS, and packet-level troubleshooting. CCIE certified since 1997 with continuous recertification across multiple technology tracks.",
    "experience": [
        {
            "title": "Senior Network Engineer",
            "company": "[Ventura County Health Care Agency](https://vchca.org)",
            "date": "2023 – Present",
            "bullets": [
                "Lead network architect modernizing clinical and corporate infrastructure supporting thousands of endpoints across multiple clinic locations, achieving 99.95% uptime for patient-facing systems.",
                "Architecting migration from legacy Cisco platforms to Catalyst 9000 series across campus and data center environments, reducing hardware footprint by 30% while improving performance and manageability.",
                "Designed and deployed Software-Defined Access fabric with Identity Services Engine for network access control, implementing micro-segmentation that reduced security incidents by 60% and achieved HIPAA compliance.",
                "Built network automation using Ansible and Python for hundreds of devices, reducing configuration errors by 80% and cutting deployment time from 3 days to 4 hours.",
                "Perform packet-level analysis using Wireshark to troubleshoot complex latency and connectivity issues impacting urgent-care systems, maintaining service levels for 24x7 clinical operations.",
                "Lead network security assessments and vulnerability remediation initiatives, achieving 95% remediation rate within 90 days and improving security posture by 40%."
            ]
        },
        {
            "title": "Principal Consultant",
            "company": "[Delta9 Technology, LLC](https://delta9.tech)",
            "date": "2017 – 2023",
            "bullets": [
                "Provided network architecture and security consulting for enterprise and public-sector clients, designing high-availability solutions for compliance-driven healthcare and law enforcement environments.",
                "Architected intrusion prevention and firewall solutions aligned with FBI CJIS and FIPS 140-2 requirements for law enforcement agencies handling sensitive criminal justice data.",
                "Led threat mitigation and incident response programs, coordinating penetration testing and implementing security controls that reduced attack surface by 70%.",
                "Designed distributed multi-site network topologies with MPLS and VPN technologies, producing integration plans for merger and acquisition activities."
            ]
        },
        {
            "title": "Network Architect",
            "company": "[DexYP](https://dexyp.com)",
            "date": "2015 – 2017",
            "bullets": [
                "Designed resilient wide-area and enterprise wireless architectures supporting thousands of users, introducing software-defined networking concepts to increase operational flexibility.",
                "Built automation frameworks with Ansible and Python to standardize configurations across network infrastructure, reducing manual errors and accelerating deployment cycles by 65%.",
                "Collaborated with security teams to implement threat detection strategies, incident response plans, and data loss prevention measures aligned with SOX and PCI compliance."
            ]
        },
        {
            "title": "Executive Director, Network & Telecom",
            "company": "YP ([Yellowpages.com](https://yellowpages.com))",
            "date": "2012 – 2015",
            "bullets": [
                "Directed network and telephony infrastructure strategy for enterprise supporting thousands of employees, managing multi-million dollar annual budget and multi-vendor project delivery.",
                "Defined project milestones, service level agreements, and resource allocation to executive stakeholders, maintaining high network availability during organizational transformation."
            ]
        },
        {
            "title": "Associate Director, Voice & Data",
            "company": "AT&T Interactive ([AT&T](https://att.com))",
            "date": "2009 – 2012",
            "bullets": [
                "Engineered and delivered six Tier 4 data center expansions supporting global production networks, implementing multi-vendor solutions within budget and timeline constraints.",
                "Designed large-scale routing architectures and MPLS networks across multiple data centers for global telecommunications infrastructure."
            ]
        },
        {
            "title": "Senior Network Engineer",
            "company": "Yahoo! ([Yahoo](https://yahoo.com)) / Overture / Goto.com",
            "date": "2001 – 2004",
            "bullets": [
                "Designed and implemented global production networks across 12 countries supporting high-traffic web services, ensuring scalability and fault tolerance.",
                "Led technology integration during major acquisitions, managing network consolidation and migration projects with minimal service disruption."
            ]
        }
    ],
    "skills": [
        {
            "cat": "Cisco Enterprise",
            "items": "Catalyst 9000, DNA/Catalyst Center, IOS-XE, SD-Access, ISE, TrustSec"
        },
        {
            "cat": "Routing & Switching",
            "items": "OSPF, BGP, EIGRP, ISIS, MPLS, VXLAN/EVPN, Multicast, QoS, VRF"
        },
        {
            "cat": "Security & Access",
            "items": "Network Access Control (ISE), 802.1X, MACsec, RADIUS/TACACS+, Firewalls, IDS/IPS, VPN"
        },
        {
            "cat": "Monitoring & Analysis",
            "items": "SolarWinds, Wireshark (packet-level), NetFlow, SNMP, Syslog, Vulnerability Testing"
        },
        {
            "cat": "Automation",
            "items": "Ansible, Python, Terraform, Git, REST APIs, Infrastructure as Code"
        },
        {
            "cat": "Cloud & Wireless",
            "items": "Azure, AWS, Cisco Wireless (9800 WLC, Wi-Fi 6/6E), Meraki"
        }
    ],
    "projects": [
        {
            "title": "Healthcare Network Modernization",
            "description": "Led enterprise-wide refresh to Catalyst 9000 platforms across multiple sites, migrating hundreds of devices to Software-Defined Access fabric. Enabled centralized policy controls and network segmentation, reducing provisioning time by 75% and achieving regulatory compliance."
        },
        {
            "title": "Zero-Trust Security Implementation",
            "description": "Replaced legacy authentication infrastructure with Identity Services Engine and TrustSec policies for thousands of endpoints. Implemented role-based access and micro-segmentation separating clinical and administrative traffic, reducing security incidents by 60%."
        },
        {
            "title": "Network Security Hardening & Compliance",
            "description": "Coordinated penetration testing and vulnerability assessments, prioritized remediation of hundreds of findings, and integrated intrusion detection and prevention controls. Achieved 95% remediation rate within 90 days and improved security posture by 40%."
        }
    ],
    "education": {
        "degree": "BS, Computer Science & Engineering",
        "school": "California State University, Long Beach"
    },
    "certifications": [
        {
            "title": "CCIE #3406 (1997)",
            "subtitle": "Routing & Switching — Maintained through continuous recertification",
            "color": "blue"
        },
        {
            "title": "Additional CCIE Tracks",
            "subtitle": "Security, IP, VoIP, Service Provider, Data Center",
            "color": "purple"
        }
    ],
    "config": {
        "titles": {
            "summary": "Professional Summary",
            "experience": "Professional Experience",
            "skills": "Technical Expertise",
            "education": "Education",
            "certifications": "Certifications",
            "projects": "Selected Projects"
        }
    }
}