{
    "profile": {
        "name": "Andy Kumeda",
        "title": "Senior Network Engineer | Network Architect",
        "ccie": "CCIE #3406",
        "email": "andy@kumeda.com",
        "phone": "(310) 493-1793",
        "website": "andykumeda.com",
        "linkedin": "https://www.linkedin.com/in/andykumeda/",
        "github": "https://github.com/andykumeda"
    },
    "summary": "Senior Network Engineer and architect with 30+ years designing, deploying, and operating large-scale Cisco networks supporting 15,000+ endpoints in enterprise and healthcare environments. Deep expertise in Catalyst 9000 platforms, SD-Access, ISE, routing & switching (OSPF, BGP, EIGRP), MPLS, QoS, VXLAN, and packet-level traffic analysis. Proven track record leading network modernization projects, security hardening initiatives, and cross-functional teams for 24x7 mission-critical healthcare services. CCIE certified since 1997 with continuous recertification across multiple tracks.",
    "experience": [
        {
            "title": "Senior Network Engineer",
            "company": "[Ventura County Health Care Agency](https://vchca.org)",
            "date": "2023 – Present",
            "bullets": [
                "Lead network architect modernizing clinical and corporate enterprise network infrastructure supporting 5,000+ endpoints across 15 clinic locations, improving security posture and achieving 99.95% uptime for patient-facing systems.",
                "Architecting and executing migration from legacy Cisco platforms to Catalyst 9000 series across campus and data center environments, reducing hardware footprint by 30% while improving performance and manageability.",
                "Designed and deployed Cisco SD-Access fabric with ISE-based NAC, replacing ACS authentication and implementing zero-trust micro-segmentation that reduced security incidents by 60% and achieved HIPAA compliance.",
                "Implemented network automation using Ansible and Python for 500+ devices, reducing configuration errors by 80% and decreasing deployment time from days to hours through Infrastructure as Code practices.",
                "Perform packet-level analysis and troubleshooting using Wireshark to resolve complex latency and connectivity issues impacting urgent-care systems, maintaining 24x7 clinical SLAs.",
                "Conduct network assessments, vulnerability testing, and security hardening initiatives, achieving 95% remediation rate within 90 days and improving overall security posture score by 40%."
            ]
        },
        {
            "title": "Principal Consultant",
            "company": "[Delta9 Technology, LLC](https://delta9.tech)",
            "date": "2017 – 2023",
            "bullets": [
                "Provided network architecture and security consulting for enterprise and public-sector clients, designing high-availability solutions for compliance-driven environments including healthcare and law enforcement.",
                "Architected IPS/IDS and next-generation firewall solutions aligned with FBI CJIS and FIPS 140-2 requirements for law enforcement agencies, ensuring secure data transmission and regulatory compliance.",
                "Led threat mitigation, incident response, and vulnerability remediation programs, coordinating penetration testing and implementing security controls that reduced attack surface by 70%.",
                "Designed distributed multi-site WAN/LAN topologies with MPLS and VPN technologies, and produced integration plans for M&A activities ensuring seamless network consolidation."
            ]
        },
        {
            "title": "Network Architect",
            "company": "[DexYP](https://dexyp.com)",
            "date": "2015 – 2017",
            "bullets": [
                "Designed resilient WAN/LAN and enterprise wireless architectures supporting 10,000+ users, introducing NFV/SDN concepts to increase operational flexibility and reduce hardware dependencies.",
                "Built automation frameworks with Ansible and Python to standardize configurations across 1,000+ network devices, reducing manual errors and accelerating deployment cycles by 65%.",
                "Collaborated with security teams to implement comprehensive threat detection strategies, incident response plans, and data loss prevention measures aligned with SOX and PCI compliance requirements."
            ]
        },
        {
            "title": "Executive Director, Network & Telecom",
            "company": "YP ([Yellowpages.com](https://yellowpages.com))",
            "date": "2012 – 2015",
            "bullets": [
                "Directed network and telephony infrastructure strategy for enterprise supporting 8,000+ employees, managing $5M annual budget and multi-vendor project delivery across distributed data centers.",
                "Defined and communicated project milestones, SLAs, and resource allocation to executive stakeholders, ensuring alignment with business objectives and maintaining 99.9% network availability."
            ]
        },
        {
            "title": "Associate Director, Voice & Data",
            "company": "AT&T Interactive ([AT&T](https://att.com))",
            "date": "2009 – 2012",
            "bullets": [
                "Engineered and delivered six Tier 4 data center expansions supporting global production networks, implementing multi-vendor solutions within budget and aggressive timelines.",
                "Designed large-scale BGP/OSPF routing architectures and MPLS networks across multiple data centers, ensuring robust and scalable infrastructure meeting enterprise requirements."
            ]
        },
        {
            "title": "Senior Network Engineer",
            "company": "Yahoo! ([Yahoo](https://yahoo.com)) / Overture / Goto.com",
            "date": "2001 – 2004",
            "bullets": [
                "Designed and implemented global production networks across 12 countries supporting high-traffic web services, ensuring scalability and fault tolerance.",
                "Led technology integration during major acquisitions (FAST, AltaVista), managing network consolidation and migration projects with minimal service disruption."
            ]
        }
    ],
    "skills": [
        {
            "cat": "Cisco Enterprise Architecture",
            "items": "Catalyst 9K, DNA/Catalyst Center, IOS-XE, SD-Access, ISE, TrustSec"
        },
        {
            "cat": "Routing & Switching",
            "items": "OSPF, BGP, EIGRP, ISIS, MPLS, VXLAN/EVPN, Multicast, QoS, VRF"
        },
        {
            "cat": "Security & Access Control",
            "items": "NAC (ISE), 802.1X, MACsec, RADIUS/TACACS+, ACS, SecurID, Firewalls (ASA/FTD/Fortigate), IDS/IPS, VPN"
        },
        {
            "cat": "Network Services",
            "items": "MetroEthernet, WAN Optimization, Remote Access, LISP, DHCP, DNS, NTP"
        },
        {
            "cat": "Monitoring & Analysis",
            "items": "SolarWinds, Wireshark (packet-level), NetFlow/IPFIX, SNMP, Syslog, Vulnerability Testing"
        },
        {
            "cat": "Automation & DevOps",
            "items": "Ansible, Python, Terraform, Git, REST APIs, NETCONF/RESTCONF, Infrastructure as Code"
        },
        {
            "cat": "Cloud & Wireless",
            "items": "Azure Networking, AWS VPC, Cisco Wireless (9800 WLC, Wi-Fi 6/6E), Meraki"
        },
        {
            "cat": "Leadership & Governance",
            "items": "Team mentoring, vendor management, policy development, compliance (HIPAA/CJIS/FIPS), technical documentation"
        }
    ],
    "projects": [
        {
            "title": "Healthcare Network Modernization",
            "description": "Led enterprise-wide refresh to Catalyst 9K platforms across 15 sites, migrating 500+ devices to SD-Access fabric architecture. Enabled centralized policy controls and zero-trust segmentation, reducing provisioning time by 75% and achieving HIPAA compliance."
        },
        {
            "title": "Zero-Trust Security Implementation",
            "description": "Replaced legacy ACS with ISE-based NAC and TrustSec policies for 5,000+ endpoints. Implemented role-based access and micro-segmentation separating clinical and administrative traffic, reducing security incidents by 60%."
        },
        {
            "title": "Network Security Hardening & Compliance",
            "description": "Coordinated penetration testing and vulnerability assessments, prioritized remediation of 200+ findings, and integrated IDS/IPS controls. Achieved 95% remediation rate within 90 days and improved security posture score by 40%."
        },
        {
            "title": "Infrastructure Automation & GitOps",
            "description": "Implemented Ansible-based automation managing 500+ network devices with Python validation scripts. Reduced manual configuration errors by 80%, decreased deployment time from days to hours, and eliminated configuration drift through version control."
        }
    ],
    "education": {
        "degree": "BS, Computer Science & Engineering",
        "school": "California State University, Long Beach"
    },
    "certifications": [
        {
            "title": "CCIE #3406",
            "subtitle": "Routing & Switching (1997)",
            "color": "blue"
        },
        {
            "title": "CCIE Recertifications",
            "subtitle": "Security, IP, VoIP, Service Provider, Data Center",
            "color": "purple"
        }
    ],
    "config": {
        "titles": {
            "summary": "Professional Summary",
            "experience": "Professional Experience",
            "skills": "Core Competencies",
            "education": "Education",
            "certifications": "Certifications",
            "projects": "Key Projects & Achievements"
        }
    }
}